comparison/results_reprod/dsb_other/bench100/compose_orig/out_2_3601.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 2 connections
  Thread calibration: mean lat.: 1779.007ms, rate sampling interval: 5279ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.09s   636.13ms   3.25s    57.20%
    Req/Sec   398.67     11.56   415.00     66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.18s 
 75.000%    2.68s 
 90.000%    2.90s 
 99.000%    3.25s 
 99.900%    3.38s 
 99.990%    3.40s 
 99.999%    3.40s 
100.000%    3.40s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1089.535     0.000000            1         1.00
    1341.439     0.100000          798         1.11
    1444.863     0.200000         1599         1.25
    1535.999     0.300000         2392         1.43
    1637.375     0.400000         3193         1.67
    2179.071     0.500000         3982         2.00
    2373.631     0.550000         4380         2.22
    2467.839     0.600000         4788         2.50
    2543.615     0.650000         5184         2.86
    2611.199     0.700000         5576         3.33
    2682.879     0.750000         5982         4.00
    2715.647     0.775000         6172         4.44
    2750.463     0.800000         6379         5.00
    2783.231     0.825000         6572         5.71
    2815.999     0.850000         6775         6.67
    2854.911     0.875000         6977         8.00
    2875.391     0.887500         7072         8.89
    2897.919     0.900000         7171        10.00
    2926.591     0.912500         7273        11.43
    2959.359     0.925000         7370        13.33
    2994.175     0.937500         7467        16.00
    3012.607     0.943750         7517        17.78
    3035.135     0.950000         7567        20.00
    3059.711     0.956250         7616        22.86
    3082.239     0.962500         7666        26.67
    3106.815     0.968750         7717        32.00
    3121.151     0.971875         7741        35.56
    3139.583     0.975000         7766        40.00
    3155.967     0.978125         7790        45.71
    3172.351     0.981250         7815        53.33
    3192.831     0.984375         7840        64.00
    3205.119     0.985938         7854        71.11
    3219.455     0.987500         7864        80.00
    3237.887     0.989062         7876        91.43
    3256.319     0.990625         7889       106.67
    3274.751     0.992188         7901       128.00
    3287.039     0.992969         7909       142.22
    3303.423     0.993750         7914       160.00
    3321.855     0.994531         7921       182.86
    3332.095     0.995313         7926       213.33
    3340.287     0.996094         7932       256.00
    3346.431     0.996484         7936       284.44
    3350.527     0.996875         7939       320.00
    3356.671     0.997266         7943       365.71
    3360.767     0.997656         7946       426.67
    3364.863     0.998047         7949       512.00
    3366.911     0.998242         7950       568.89
    3371.007     0.998437         7952       640.00
    3373.055     0.998633         7953       731.43
    3375.103     0.998828         7955       853.33
    3379.199     0.999023         7957      1024.00
    3379.199     0.999121         7957      1137.78
    3379.199     0.999219         7957      1280.00
    3383.295     0.999316         7959      1462.86
    3383.295     0.999414         7959      1706.67
    3387.391     0.999512         7960      2048.00
    3387.391     0.999561         7960      2275.56
    3387.391     0.999609         7960      2560.00
    3391.487     0.999658         7961      2925.71
    3391.487     0.999707         7961      3413.33
    3395.583     0.999756         7962      4096.00
    3395.583     0.999780         7962      4551.11
    3395.583     0.999805         7962      5120.00
    3395.583     0.999829         7962      5851.43
    3395.583     0.999854         7962      6826.67
    3399.679     0.999878         7963      8192.00
    3399.679     1.000000         7963          inf
#[Mean    =     2092.431, StdDeviation   =      636.126]
#[Max     =     3397.632, Total count    =         7963]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11312 requests in 30.00s, 2.32MB read
  Non-2xx or 3xx responses: 3
Requests/sec:    377.07
Transfer/sec:     79.18KB