comparison/results_reprod/dsb_other/bench100/compose_orig/out_2_4201.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 2 connections
  Thread calibration: mean lat.: 2007.183ms, rate sampling interval: 5021ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.62s   458.85ms   3.39s    57.82%
    Req/Sec   358.00      7.79   369.00     66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.57s 
 75.000%    3.05s 
 90.000%    3.26s 
 99.000%    3.39s 
 99.900%    3.43s 
 99.990%    3.45s 
 99.999%    3.45s 
100.000%    3.45s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1744.895     0.000000            1         1.00
    2024.447     0.100000          708         1.11
    2168.831     0.200000         1426         1.25
    2293.759     0.300000         2128         1.43
    2410.495     0.400000         2836         1.67
    2568.191     0.500000         3549         2.00
    2670.591     0.550000         3895         2.22
    2795.519     0.600000         4252         2.50
    2914.303     0.650000         4606         2.86
    2985.983     0.700000         4959         3.33
    3049.471     0.750000         5314         4.00
    3080.191     0.775000         5488         4.44
    3110.911     0.800000         5675         5.00
    3143.679     0.825000         5846         5.71
    3180.543     0.850000         6016         6.67
    3219.455     0.875000         6197         8.00
    3239.935     0.887500         6282         8.89
    3260.415     0.900000         6373        10.00
    3278.847     0.912500         6463        11.43
    3293.183     0.925000         6548        13.33
    3309.567     0.937500         6645        16.00
    3315.711     0.943750         6681        17.78
    3325.951     0.950000         6733        20.00
    3334.143     0.956250         6770        22.86
    3344.383     0.962500         6816        26.67
    3352.575     0.968750         6857        32.00
    3358.719     0.971875         6883        35.56
    3362.815     0.975000         6901        40.00
    3368.959     0.978125         6923        45.71
    3375.103     0.981250         6947        53.33
    3381.247     0.984375         6967        64.00
    3385.343     0.985938         6981        71.11
    3389.439     0.987500         6995        80.00
    3391.487     0.989062         7000        91.43
    3395.583     0.990625         7011       106.67
    3401.727     0.992188         7027       128.00
    3403.775     0.992969         7032       142.22
    3405.823     0.993750         7036       160.00
    3407.871     0.994531         7039       182.86
    3411.967     0.995313         7048       213.33
    3416.063     0.996094         7054       256.00
    3416.063     0.996484         7054       284.44
    3418.111     0.996875         7056       320.00
    3420.159     0.997266         7058       365.71
    3422.207     0.997656         7061       426.67
    3424.255     0.998047         7064       512.00
    3426.303     0.998242         7066       568.89
    3426.303     0.998437         7066       640.00
    3428.351     0.998633         7068       731.43
    3430.399     0.998828         7069       853.33
    3432.447     0.999023         7071      1024.00
    3432.447     0.999121         7071      1137.78
    3434.495     0.999219         7072      1280.00
    3438.591     0.999316         7073      1462.86
    3438.591     0.999414         7073      1706.67
    3440.639     0.999512         7074      2048.00
    3440.639     0.999561         7074      2275.56
    3444.735     0.999609         7075      2560.00
    3444.735     0.999658         7075      2925.71
    3444.735     0.999707         7075      3413.33
    3446.783     0.999756         7076      4096.00
    3446.783     0.999780         7076      4551.11
    3446.783     0.999805         7076      5120.00
    3446.783     0.999829         7076      5851.43
    3446.783     0.999854         7076      6826.67
    3450.879     0.999878         7077      8192.00
    3450.879     1.000000         7077          inf
#[Mean    =     2622.462, StdDeviation   =      458.854]
#[Max     =     3448.832, Total count    =         7077]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10774 requests in 30.00s, 2.21MB read
  Non-2xx or 3xx responses: 1
Requests/sec:    359.08
Transfer/sec:     75.39KB