comparison/results_reprod/dsb_other/bench100/compose_orig/out_3_201.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 3 connections
  Thread calibration: mean lat.: 5.055ms, rate sampling interval: 15ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.03ms    7.54ms  53.09ms   96.88%
    Req/Sec   207.43    112.65   500.00     62.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.24ms
 75.000%    5.43ms
 90.000%    8.05ms
 99.000%   53.09ms
 99.900%   90.30ms
 99.990%   95.55ms
 99.999%   95.55ms
100.000%   95.55ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.383     0.000000            1         1.00
       3.653     0.100000          405         1.11
       3.773     0.200000          808         1.25
       3.899     0.300000         1204         1.43
       4.055     0.400000         1608         1.67
       4.239     0.500000         2011         2.00
       4.351     0.550000         2208         2.22
       4.495     0.600000         2408         2.50
       4.691     0.650000         2609         2.86
       5.011     0.700000         2810         3.33
       5.427     0.750000         3009         4.00
       5.859     0.775000         3109         4.44
       6.191     0.800000         3209         5.00
       6.635     0.825000         3310         5.71
       7.119     0.850000         3410         6.67
       7.539     0.875000         3510         8.00
       7.775     0.887500         3561         8.89
       8.047     0.900000         3610        10.00
       8.423     0.912500         3662        11.43
       8.919     0.925000         3711        13.33
       9.599     0.937500         3761        16.00
      10.167     0.943750         3786        17.78
      10.799     0.950000         3811        20.00
      11.519     0.956250         3836        22.86
      12.311     0.962500         3861        26.67
      13.551     0.968750         3886        32.00
      15.191     0.971875         3899        35.56
      16.023     0.975000         3911        40.00
      20.815     0.978125         3924        45.71
      24.511     0.981250         3936        53.33
      39.007     0.984375         3949        64.00
      42.207     0.985938         3955        71.11
      47.967     0.987500         3961        80.00
      51.583     0.989062         3968        91.43
      53.535     0.990625         3974       106.67
      56.767     0.992188         3980       128.00
      59.487     0.992969         3983       142.22
      61.087     0.993750         3986       160.00
      63.871     0.994531         3990       182.86
      64.767     0.995313         3993       213.33
      66.751     0.996094         3996       256.00
      67.903     0.996484         3997       284.44
      72.511     0.996875         3999       320.00
      73.791     0.997266         4001       365.71
      75.839     0.997656         4002       426.67
      76.991     0.998047         4004       512.00
      76.991     0.998242         4004       568.89
      79.615     0.998437         4005       640.00
      83.775     0.998633         4006       731.43
      90.303     0.998828         4007       853.33
      91.455     0.999023         4008      1024.00
      91.455     0.999121         4008      1137.78
      91.455     0.999219         4008      1280.00
      91.519     0.999316         4009      1462.86
      91.519     0.999414         4009      1706.67
      94.207     0.999512         4010      2048.00
      94.207     0.999561         4010      2275.56
      94.207     0.999609         4010      2560.00
      94.207     0.999658         4010      2925.71
      94.207     0.999707         4010      3413.33
      95.551     0.999756         4011      4096.00
      95.551     1.000000         4011          inf
#[Mean    =        6.031, StdDeviation   =        7.540]
#[Max     =       95.488, Total count    =         4011]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6022 requests in 30.00s, 1.23MB read
  Non-2xx or 3xx responses: 1
Requests/sec:    200.74
Transfer/sec:     42.15KB